---
kind: type
id: T:Autodesk.Revit.UI.AddInCommandBinding
source: html/a457ac93-b849-d962-8719-2b3910358b04.htm
---
# Autodesk.Revit.UI.AddInCommandBinding

This object represents a binding between a Revit command and one or more handlers which
override the behavior of the command in Revit.

## Syntax (C#)
```csharp
public class AddInCommandBinding
```